brew "git"
brew "pyenv"
brew "archey"
brew "thefuck"
brew "mackup"
brew "python"
brew "mailsy"
brew "imagemagick"
brew "fastfetch"

cask "raycast"
cask "middleclick"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "webpquicklook"
cask "suspicious-package"
cask "iina"
cask "betterzip"
cask "appcleaner"
cask "superduper"
cask "qbittorrent@lt20"
cask "radio-silence"
cask "linearmouse"
cask "mediamate"
cask "swish"
cask "hiddenbar"
cask "dropzone"
cask "alt-tab"
cask "stats"
cask "itsycal"