# utils
brew 'git'
brew 'mackup' # backup manager
brew 'mailsy' # temporary mail CLI
brew 'imagemagick' # image processing
brew 'fastfetch' # system info
brew 'tree'
brew 'mas' # mac app store CLI
brew 'ffmpeg'
brew 'asitop' # cpu usage monitor

# macos quicklook utils
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'webpquicklook'
cask 'suspicious-package'

# dev tools
brew 'watchman'
brew 'gh' # github CLI
brew 'gitui' # git GUI
brew 'vsce' # vscode extension manager
brew 'pnpm'

# terminal utilities
cask 'ghostty'
brew 'zsh-completions'
brew 'bitwarden-cli'

# dev apps
cask 'visual-studio-code'
cask 'docker'
cask 'yaak'

# environments
brew 'uv'
brew 'openjdk'
brew 'node'
brew 'fnm'

# browsers
cask 'google-chrome'
cask 'zen-browser'

# design
cask 'figma'
cask 'ogdesign-eagle'

# apps
cask 'raycast'
cask 'iina' # video player
cask 'keka' # archive manager
cask 'superduper' # backup utility
cask 'qbittorrent@lt20'
cask 'spotify'
cask 'discord'
cask 'bitwarden'
cask 'notion'
cask 'cyberduck' # ftp transfers

# utilities apps
cask 'linearmouse' # linear mouse movement
cask 'middleclick'
cask 'tabtab'
cask 'google-drive'
cask 'stats' # menubar computer statistics
cask 'appcleaner'
cask 'batfi'